app/Controllers/Auth.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function login()
    {
        log_message('debug', 'Método login llamado');

        if ($this->request->getMethod() === 'POST') {
            log_message('debug', 'Método POST detectado');

            $username = $this->request->getPost('username');
            $password = $this->request->getPost('password');

            log_message('debug', 'Datos recibidos - Username: ' . $username);

            // Verificación manual
            if ($username === 'admin' && $password === 'admin123') {
                $model = new UserModel();
                $user = $model->where('username', 'admin')->first();