app/Controllers/Documents.php

    public function index()
    {
        $category_id = $this->request->getGet('category_id');
        $career_id = $this->request->getGet('career_id');
        $year = $this->request->getGet('year');
        $period_id = $this->request->getGet('period_id');

        // Construir la consulta base
        $query = $this->documentModel->select('documents.*, categories.name as category_name, careers.name as career_name, academic_periods.name as period_name')
            ->join('categories', 'categories.id = documents.category_id')
            ->join('careers', 'careers.id = documents.career_id')
            ->join('academic_periods', 'academic_periods.id = documents.academic_period_id');

        // Aplicar filtros si existen
        if ($category_id) {
            $query->where('documents.category_id', $category_id);
        }
        if ($career_id) {
            $query->where('documents.career_id', $career_id);
        }
        if ($year) {
            $query->where('documents.publication_year', $year);
        }
        if ($period_id) {
            $query->where('documents.academic_period_id', $period_id);
        }


        $data = [
            'documents' => $query->findAll(),
            'categories' => $this->categoryModel->findAll(),
            'careers' => $this->careerModel->findAll(),
            'periods' => $this->academicPeriodModel->findAll(),
            'years' => $this->getYearsList(),
            // Mantener los filtros seleccionados
            'selected_category' => $category_id,
            'selected_career' => $career_id,
            'selected_year' => $year,
            'selected_period' => $period_id
        ];
---
SELECT `documents`.*, `categories`.`name` as `category_name`, `careers`.`name` as `career_name`, `academic_periods`.`name` as `period_name`
FROM `documents`
JOIN `categories` ON `categories`.`id` = `documents`.`category_id`
JOIN `careers` ON `careers`.`id` = `documents`.`career_id`
JOIN `academic_periods` ON `academic_periods`.`id` = `documents`.`academic_period_id`
WHERE `documents`.`career_id` = '2'
SELECT *
FROM `categories`
SELECT *
FROM `careers`
SELECT *
FROM `academic_periods`

    private function getYearsList()
    {
        // Obtener años únicos de los documentos
        $years = $this->documentModel->select('DISTINCT(publication_year) as year')
            ->orderBy('publication_year', 'DESC')
            ->findAll();
---
SELECT DISTINCT(publication_year) as year
FROM `documents`
ORDER BY `publication_year` DESC