app/Controllers/ProduccionController.php

    public function delete($id)
    {
        try {
            $produccion = $this->produccionModel->find($id);

            if (!$produccion) {
                throw new Exception('Producción no encontrada');
            }

            // Eliminar documento si existe
            if (!empty($produccion['documento_path'])) {
                @unlink(ROOTPATH . 'public/' . $produccion['documento_path']);
            }

            // Eliminar registro y sus relaciones
            $this->produccionModel->db->transBegin();

            try {
                // Eliminar relaciones de participantes
                $this->produccionModel->db->table('produccion_participantes')
                    ->where('produccion_id', $id)
                    ->delete();
---
DELETE FROM `produccion_participantes`
WHERE `produccion_id` = '29'