app/Controllers/ProduccionController.php

SELECT *
FROM `participantes`
WHERE `cedula` = '10'
INSERT INTO `participantes` (`nombre`, `cedula`) VALUES ('Ronaldo', '7')
---
    private function insertOrGetParticipante($data)
    {
        $participante = $this->produccionModel->db->table('participantes')
            ->where('cedula', $data['cedula'])
            ->get()
            ->getRowArray();

        if ($participante) {
            return $participante['id'];
        }

        $this->produccionModel->db->table('participantes')->insert($data);

INSERT INTO `produccion_participantes` (`produccion_id`, `participante_id`, `tipo`) VALUES ('31', '23', 'Autor')
---
    private function insertProduccionParticipante($produccionId, $participanteId, $tipo)
    {
        $data = [
            'produccion_id' => $produccionId,
            'participante_id' => $participanteId,
            'tipo' => $tipo
        ];

        $this->produccionModel->db->table('produccion_participantes')->insert($data);

DELETE FROM `produccion_participantes`
WHERE `produccion_id` = '31'
---
                $this->produccionModel->update($id, $data);

                // Eliminar relaciones existentes de participantes
                $this->produccionModel->db->table('produccion_participantes')
                    ->where('produccion_id', $id)
                    ->delete();

DELETE FROM `produccion_participantes`
WHERE `produccion_id` = '21'
---
    public function delete($id)
    {
        try {
            $produccion = $this->produccionModel->find($id);

            if (!$produccion) {
                throw new Exception('Producción no encontrada');
            }

            // Eliminar documento si existe
            if (!empty($produccion['documento_path'])) {
                @unlink(ROOTPATH . 'public/' . $produccion['documento_path']);
            }

            // Eliminar registro y sus relaciones
            $this->produccionModel->db->transBegin();

            try {
                // Eliminar relaciones de participantes
                $this->produccionModel->db->table('produccion_participantes')
                    ->where('produccion_id', $id)
                    ->delete();