app/Controllers/ReportesPIS.php

    public function index()
    {
        $programa_id = $this->request->getGet('programa_id');
        $linea_id = $this->request->getGet('linea_id');
        $anio = $this->request->getGet('anio');

        // Construir la consulta base
        $builder = $this->pisModel->db->table('proyectos_integradores_saberes')
            ->select('proyectos_integradores_saberes.*,
                programas.nombre_programa,
                lineas_investigacion_carreras.nombre_linea')
            ->join('programas', 'programas.id = proyectos_integradores_saberes.programa_id', 'left')
            ->join('lineas_investigacion_carreras',
                'lineas_investigacion_carreras.id = proyectos_integradores_saberes.linea_investigacion_carrera_id', 'left')
            ->orderBy('proyectos_integradores_saberes.created_at', 'DESC');

        // Aplicar filtros
        if ($programa_id) {
            $builder->where('proyectos_integradores_saberes.programa_id', $programa_id);
        }
        if ($linea_id) {
            $builder->where('proyectos_integradores_saberes.linea_investigacion_carrera_id', $linea_id);
        }
        if ($anio) {
            $builder->where('proyectos_integradores_saberes.anio', $anio);
        }

        // Obtener proyectos y procesar participantes
        $proyectos = $builder->get()->getResultArray();
---
SELECT `proyectos_integradores_saberes`.*, `programas`.`nombre_programa`, `lineas_investigacion_carreras`.`nombre_linea`
FROM `proyectos_integradores_saberes`
LEFT JOIN `programas` ON `programas`.`id` = `proyectos_integradores_saberes`.`programa_id`
LEFT JOIN `lineas_investigacion_carreras` ON `lineas_investigacion_carreras`.`id` = `proyectos_integradores_saberes`.`linea_investigacion_carrera_id`
ORDER BY `proyectos_integradores_saberes`.`created_at` DESC