app/Models/ParticipanteModel.php

SELECT `docentes`.*, `pis_docentes`.`id` as `pis_participante_id`
FROM `docentes`
JOIN `pis_docentes` ON `pis_docentes`.`docente_id` = `docentes`.`id`
WHERE `pis_docentes`.`proyecto_id` = '45'
SELECT `estudiantes`.*, `pis_estudiantes`.`id` as `pis_participante_id`
FROM `estudiantes`
JOIN `pis_estudiantes` ON `pis_estudiantes`.`estudiante_id` = `estudiantes`.`id`
WHERE `pis_estudiantes`.`proyecto_id` = '45'
---
    public function getByPIS($pisId, $type = 'docente')
    {
        $this->setTableAndValidation($type);
        $pivotTable = $type === 'estudiante' ? 'pis_estudiantes' : 'pis_docentes';
        $participanteColumn = $type === 'estudiante' ? 'estudiante_id' : 'docente_id';

        try {
            return $this->db->table($this->table)
                        ->select($this->table . '.*, ' . $pivotTable . '.id as pis_participante_id')
                        ->join($pivotTable, $pivotTable . '.' . $participanteColumn . ' = ' . $this->table . '.id')
                        ->where($pivotTable . '.proyecto_id', $pisId)
                        ->get()
                        ->getResultArray();

SELECT `docentes`.*
FROM `pis_docentes`
JOIN `docentes` ON `docentes`.`id` = `pis_docentes`.`docente_id`
WHERE `pis_docentes`.`proyecto_id` = '57'
ORDER BY `pis_docentes`.`created_at` ASC
 LIMIT 1
SELECT `estudiantes`.*
FROM `pis_estudiantes`
JOIN `estudiantes` ON `estudiantes`.`id` = `pis_estudiantes`.`estudiante_id`
WHERE `pis_estudiantes`.`proyecto_id` = '57'
ORDER BY `pis_estudiantes`.`created_at` ASC
 LIMIT 1
---
    public function getFirstParticipante($pisId, $tipo)
    {
        try {
            // Para cuando el tipo es 'Docente/Estudiante'
            if ($tipo === 'Docente/Estudiante') {
                $primerDocente = $this->db->table('pis_docentes')
                    ->select('docentes.*')
                    ->join('docentes', 'docentes.id = pis_docentes.docente_id')
                    ->where('pis_docentes.proyecto_id', $pisId)
                    ->orderBy('pis_docentes.created_at', 'ASC')
                    ->limit(1)
                    ->get()
                    ->getRowArray();

                $primerEstudiante = $this->db->table('pis_estudiantes')
                    ->select('estudiantes.*')
                    ->join('estudiantes', 'estudiantes.id = pis_estudiantes.estudiante_id')
                    ->where('pis_estudiantes.proyecto_id', $pisId)
                    ->orderBy('pis_estudiantes.created_at', 'ASC')
                    ->limit(1)
                    ->get()
                    ->getRowArray();

SELECT `docentes`.*
FROM `pis_docentes`
JOIN `docentes` ON `docentes`.`id` = `pis_docentes`.`docente_id`
WHERE `pis_docentes`.`proyecto_id` = '54'
ORDER BY `pis_docentes`.`created_at` ASC
 LIMIT 1
---

            // Para cuando el tipo es solo 'Docente'
            if ($tipo === 'Docente') {
                return $this->db->table('pis_docentes')
                    ->select('docentes.*')
                    ->join('docentes', 'docentes.id = pis_docentes.docente_id')
                    ->where('pis_docentes.proyecto_id', $pisId)
                    ->orderBy('pis_docentes.created_at', 'ASC')
                    ->limit(1)
                    ->get()
                    ->getRowArray();

SELECT `estudiantes`.*
FROM `pis_estudiantes`
JOIN `estudiantes` ON `estudiantes`.`id` = `pis_estudiantes`.`estudiante_id`
WHERE `pis_estudiantes`.`proyecto_id` = '55'
ORDER BY `pis_estudiantes`.`created_at` ASC
 LIMIT 1
---

            // Para cuando el tipo es solo 'Estudiante'
            if ($tipo === 'Estudiante') {
                return $this->db->table('pis_estudiantes')
                    ->select('estudiantes.*')
                    ->join('estudiantes', 'estudiantes.id = pis_estudiantes.estudiante_id')
                    ->where('pis_estudiantes.proyecto_id', $pisId)
                    ->orderBy('pis_estudiantes.created_at', 'ASC')
                    ->limit(1)
                    ->get()
                    ->getRowArray();