app/Models/PISModelo.php

    public function getProgramas()
    {
        try {
            $builder = $this->db->table('programas');
            return $builder->select('id, nombre_programa')
                          ->get()
                          ->getResultArray();
---
SELECT `id`, `nombre_programa`
FROM `programas`

    public function getLineasInvestigacion()
    {
        try {
            $builder = $this->db->table('lineas_investigacion_carreras');
            return $builder->select('id, nombre_linea')
                          ->get()
                          ->getResultArray();
---
SELECT `id`, `nombre_linea`
FROM `lineas_investigacion_carreras`

    public function getCamposAmplios()
    {
        try {
            $builder = $this->db->table('campo_amplio');
            return $builder->select('id, nombre_amplio')
                          ->get()
                          ->getResultArray();
---
SELECT `id`, `nombre_amplio`
FROM `campo_amplio`

    public function getCamposEspecificos($amplioId = null)
    {
        try {
            $builder = $this->db->table('campo_especifico');
            if ($amplioId) {
                $builder->where('amplio_id', $amplioId);
            }
            return $builder->select('id, nombre_especifico')
                          ->get()
                          ->getResultArray();
---
SELECT `id`, `nombre_especifico`
FROM `campo_especifico`

    public function getCamposDetallados($especificoId = null)
    {
        try {
            $builder = $this->db->table('campo_detallado');
            if ($especificoId) {
                $builder->where('especifico_id', $especificoId);
            }
            return $builder->select('id, nombre_detallado')
                          ->get()
                          ->getResultArray();
---
SELECT `id`, `nombre_detallado`
FROM `campo_detallado`

    public function getProduccionesCientificas()
    {
        try {
            $builder = $this->db->table('produccion_cientifica_tecnica');
            return $builder->select('id, nombre')
                          ->get()
                          ->getResultArray();
---
SELECT `id`, `nombre`
FROM `produccion_cientifica_tecnica`

    public function getProyectoConRelaciones($id)
    {
        try {
            $proyecto = $this->find($id);

            if ($proyecto) {
                // Obtener datos relacionados
                if ($proyecto['programa_id']) {
                    $programa = $this->db->table('programas')
                        ->where('id', $proyecto['programa_id'])
                        ->get()
                        ->getRowArray();
                    $proyecto['programa'] = $programa ? $programa['nombre_programa'] : null;
                }

                if ($proyecto['linea_investigacion_carrera_id']) {
                    $linea = $this->db->table('lineas_investigacion_carreras')
                        ->where('id', $proyecto['linea_investigacion_carrera_id'])
                        ->get()
                        ->getRowArray();
---
SELECT *
FROM `programas`
WHERE `id` = '2'
SELECT *
FROM `lineas_investigacion_carreras`
WHERE `id` = '61'

    public function getLineasConCarrera()
    {
        try {
            return $this->db->table('lineas_investigacion_carreras')
                        ->select('lineas_investigacion_carreras.*, careers.name as carrera_nombre')
                        ->join('careers', 'careers.id = lineas_investigacion_carreras.carrera_id', 'left')
                        ->get()
                        ->getResultArray();
---
SELECT `lineas_investigacion_carreras`.*, `careers`.`name` as `carrera_nombre`
FROM `lineas_investigacion_carreras`
LEFT JOIN `careers` ON `careers`.`id` = `lineas_investigacion_carreras`.`carrera_id`

    public function getLineaInvestigacion($id)
    {
        try {
            return $this->db->table('lineas_investigacion_carreras')
                        ->where('id', $id)
                        ->get()
                        ->getRowArray();
---
SELECT *
FROM `lineas_investigacion_carreras`
WHERE `id` = '106'

    public function deleteLineaInvestigacion($id)
    {
        try {
            // Verificar si la línea está siendo usada
            $proyectosRelacionados = $this->db->table('proyectos_integradores_saberes')
                                            ->where('linea_investigacion_carrera_id', $id)
                                            ->countAllResults();

            if ($proyectosRelacionados > 0) {
                return false;
            }

            return $this->db->table('lineas_investigacion_carreras')
                        ->where('id', $id)
                        ->delete();
---
SELECT COUNT(*) AS `numrows`
FROM `proyectos_integradores_saberes`
WHERE `linea_investigacion_carrera_id` = '106'
DELETE FROM `lineas_investigacion_carreras`
WHERE `id` = '106'

    public function isLineaEnUso($id)
    {
        try {
            return $this->db->table('proyectos_integradores_saberes')
                        ->where('linea_investigacion_carrera_id', $id)
                        ->countAllResults() > 0;
---
SELECT COUNT(*) AS `numrows`
FROM `proyectos_integradores_saberes`
WHERE `linea_investigacion_carrera_id` = '106'

    public function getCareers()
    {
        try {
            return $this->db->table('careers')
                        ->select('id, name')
                        ->get()
                        ->getResultArray();
---
SELECT `id`, `name`
FROM `careers`