app/Models/PISModelo.php

SELECT `id`, `titulo`
FROM `produccion_cientifica_tecnica`
---
    public function getProduccionesCientificas()
    {
        try {
            $builder = $this->db->table('produccion_cientifica_tecnica');
            return $builder->select('id, titulo')
                          ->get()
                          ->getResultArray();