app/Models/ProduccionModel.php

    public function getBaseDatos()
    {
        try {
            return $this->db->table('base_datos_indexada')
                        ->select('id, nombre')
                        ->get()
                        ->getResultArray();
---
SELECT `id`, `nombre`
FROM `base_datos_indexada`

    public function getCamposAmplios()
    {
        try {
            return $this->db->table('campo_amplio')
                        ->select('id, nombre_amplio')
                        ->get()
                        ->getResultArray();
---
SELECT `id`, `nombre_amplio`
FROM `campo_amplio`

    public function getCamposEspecificos($amplioId = null)
    {
        try {
            $builder = $this->db->table('campo_especifico');
            if ($amplioId) {
                $builder->where('amplio_id', $amplioId);
            }
            return $builder->select('id, nombre_especifico')
                        ->get()
                        ->getResultArray();
---
SELECT `id`, `nombre_especifico`
FROM `campo_especifico`
WHERE `amplio_id` = '8'

    public function getCamposDetallados($especificoId = null)
    {
        try {
            $builder = $this->db->table('campo_detallado');
            if ($especificoId) {
                $builder->where('especifico_id', $especificoId);
            }
            return $builder->select('id, nombre_detallado')
                        ->get()
                        ->getResultArray();
---
SELECT `id`, `nombre_detallado`
FROM `campo_detallado`
WHERE `especifico_id` = '17'

    public function getProduccionConRelaciones($id)
    {
        try {
            $produccion = $this->find($id);

            if ($produccion) {
                // Obtener campo amplio
                if ($produccion['campo_amplio_id']) {
                    $campoAmplio = $this->db->table('campo_amplio')
                        ->where('id', $produccion['campo_amplio_id'])
                        ->get()
                        ->getRowArray();
                    $produccion['campo_amplio'] = $campoAmplio ? $campoAmplio['nombre_amplio'] : null;
                }

                // Obtener campo específico
                if ($produccion['campo_especifico_id']) {
                    $campoEspecifico = $this->db->table('campo_especifico')
                        ->where('id', $produccion['campo_especifico_id'])
                        ->get()
                        ->getRowArray();
                    $produccion['campo_especifico'] = $campoEspecifico ? $campoEspecifico['nombre_especifico'] : null;
                }

                // Obtener campo detallado
                if ($produccion['campo_detallado_id']) {
                    $campoDetallado = $this->db->table('campo_detallado')
                        ->where('id', $produccion['campo_detallado_id'])
                        ->get()
                        ->getRowArray();
---
SELECT *
FROM `campo_amplio`
WHERE `id` = '8'
SELECT *
FROM `campo_especifico`
WHERE `id` = '17'
SELECT *
FROM `campo_detallado`
WHERE `id` = '49'

    public function getProduccionWithParticipantes($id)
    {
        try {
            $produccion = $this->getProduccionConRelaciones($id);

            if ($produccion) {
                // Obtener participantes
                $participantes = $this->db->table('produccion_participantes')
                    ->select('participantes.*, produccion_participantes.tipo as rol')
                    ->join('participantes', 'participantes.id = produccion_participantes.participante_id')
                    ->where('produccion_participantes.produccion_id', $id)
                    ->get()
                    ->getResultArray();
---
SELECT `participantes`.*, `produccion_participantes`.`tipo` as `rol`
FROM `produccion_participantes`
JOIN `participantes` ON `participantes`.`id` = `produccion_participantes`.`participante_id`
WHERE `produccion_participantes`.`produccion_id` = '26'